trade_exp/src/Documents/ТелефонныйЗвонок/ТелефонныйЗвонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТелефонныйЗвонок</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="86df8648-e195-4661-99ee-6052788eb276">
    <name>Входящий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fc37008-c378-4a70-a9a9-07543c7248a6">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0dfbe7a9-9c2e-4cbd-ac53-3b547fd73e91">
    <name>АбонентПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a22cf6e9-1157-4be5-8d30-aa9bbf2b5e6e">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67ef6671-f537-46bf-88e6-f5bcf34a17a4">
    <name>АбонентКакСвязаться</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de778ca7-feaf-4531-80ae-11a534c56928">
    <name>АбонентКонтакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6410853e-a17e-44db-b8cc-bfefd7c4d239">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35133725-9647-42dc-a76a-2e62b2918ac4">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b6c4184-6d7d-48e5-bd4e-ad31e63398d6">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0a76a84d-e883-477e-8b87-7bf984cdc1cf">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7b883dc-6c26-4eb5-bc19-7919ad57da27">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12055ab8-aa14-44ba-a952-006febab54b8">
    <name>ТипОбращения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="470f2f3d-68f1-43aa-b017-17ec1b19cb78">
    <name>НачалоСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55d708be-f064-4170-b8fd-d27aa4db0369">
    <name>ОкончаниеСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="425631ea-c386-43ef-91c7-6e111ae572ff">
    <name>ТипСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="851e22e5-891f-498d-89f6-d471f241ab76">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d207962d-87fa-4f4c-a30b-62dcde13017f">
    <name>ВходящееИсходящееСобытие</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/InformationRegisters/АнкетированиеОтветы/АнкетированиеОтветы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="643577fd-9487-4e88-8c72-f629d61be78a">
  <name>АнкетированиеОтветы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="baaf8d9e-d4a6-4963-8596-754959116e3a">
    <name>Ответ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="e256b4bd-802d-49bb-b102-a8a503cdade3">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9b8e7ba-6e34-4fc4-ab59-9b811bce2b8e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="450b72de-90b7-4737-bff9-c7f6bdd9000a">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4718741d-63cc-449c-a76e-28dbde8626b3">
    <name>Респондент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de8e365b-475f-42e3-a8ba-6e024fccc41c">
    <name>ШаблонАнкеты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a8389e52-1ac9-4fa5-b40a-4f0ef8acad3e">
    <name>Вопрос</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="95c1ddea-87da-4937-a9f2-da03fedf4b21">
    <name>НомерВарианта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="01ec4547-6443-416c-946b-51cf00035440">
    <name>ДатаЗаполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ТелефонныйЗвонок/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ТипЗвонка=?(Объект.Входящий,1,0);
	ЗаполнитьТемуЗвонка(Предмет); 
	Элементы.Форма_СоздатьАнкету.доступность=значениезаполнено(Объект.Ссылка);
	Элементы.Форма_СоздатьАнкету.Заголовок=ВернутьЗаголовокКомандыОпроса();
КонецПроцедуры

&НаСервере
Функция ВернутьЗаголовокКомандыОпроса()
	если значениезаполнено(Объект.Ссылка) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АнкетированиеОтветы.Респондент КАК Респондент,
		|	АнкетированиеОтветы.ШаблонАнкеты КАК ШаблонАнкеты,
		|	АнкетированиеОтветы.ДатаЗаполнения КАК ДатаЗаполнения
		|ИЗ
		|	РегистрСведений.АнкетированиеОтветы КАК АнкетированиеОтветы
		|ГДЕ
		|	АнкетированиеОтветы.ВзаимодействиеОснование = &ВзаимодействиеОснование";
		
		Запрос.УстановитьПараметр("ВзаимодействиеОснование", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		если ВыборкаДетальныеЗаписи.Следующий() тогда
			ПараметрыОпроса=Новый Структура();
			ПараметрыОпроса.Вставить("Респондент",ВыборкаДетальныеЗаписи.Респондент);
			ПараметрыОпроса.Вставить("ШаблонАнкеты",ВыборкаДетальныеЗаписи.ШаблонАнкеты);
			ПараметрыОпроса.Вставить("ДатаЗаполнения",ВыборкаДетальныеЗаписи.ДатаЗаполнения);
			возврат "Посмотреть результаты опроса";
		Конецесли;
	конецесли;	
	возврат "Создать опрос";
КонецФункции // ()

&НаСервере
Процедура ЗаполнитьТемуЗвонка(ВыбранныйПредмет)
	если не значениезаполнено(Объект.Тема) и  значениезаполнено(ВыбранныйПредмет) тогда
		если Метаданные.Документы.Содержит(Метаданные.НайтиПоТипу(типзнч(ВыбранныйПредмет))) тогда
			Объект.Тема=""+типзнч(ВыбранныйПредмет)+" №"+ВыбранныйПредмет.Номер+" от "+ВыбранныйПредмет.Дата;
		иначеесли Метаданные.Справочники.Содержит(Метаданные.НайтиПоТипу(типзнч(ВыбранныйПредмет))) тогда
			Объект.Тема=""+типзнч(ВыбранныйПредмет)+" "+ВыбранныйПредмет.Наименование;
		конецесли;	
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипЗвонкаПриИзмененииПосле(Элемент)
	Объект.Входящий=?(ТипЗвонка=1,истина,ложь);
КонецПроцедуры


&НаСервере
Процедура СформироватьТабличныйДокументОпроса(ПараметрыОпроса,ТабДок)
	
	РегистрыСведений.АнкетированиеОтветы.СформироватьТабличныйДокументОпроса(ПараметрыОпроса.Респондент, ПараметрыОпроса.ШаблонАнкеты,ПараметрыОпроса.ДатаЗаполнения, ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура Док__СоздатьАнкетуПосле(Команда)
	если Элементы.Форма_СоздатьАнкету.Заголовок="Создать опрос" тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьОпросЗавершение", ЭтаФорма);
		ПараметрыФормы = Новый Структура("ВзаимодействиеОснование", Объект.ссылка);
		если типзнч(Объект.АбонентКонтакт)=тип("СправочникСсылка.Партнеры") тогда
			ПараметрыФормы.Вставить("Респондент",Объект.АбонентКонтакт);
		конецесли;	
		ОткрытьФорму("РегистрСведений.АнкетированиеОтветы.Форма.ФормаАнкетирования",ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	иначе
		ТабДок = Новый ТабличныйДокумент;
		СформироватьТабличныйДокументОпроса(ПараметрыОпроса,ТабДок);
		ТабДок.Показать("Результаты опроса");
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОпросЗавершение(Результат, ДополнительныеПараметры) экспорт
	Элементы.Форма_СоздатьАнкету.Заголовок=ВернутьЗаголовокКомандыОпроса();
	если Элементы.Форма_СоздатьАнкету.Заголовок="Посмотреть результаты опроса" тогда
		Объект.описание=Объект.Описание+" Создан опрос";
    конецесли;
КонецПроцедуры


&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	Элементы.Форма_СоздатьАнкету.доступность=значениезаполнено(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура Док_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
	если КонтекстВыбора = "ВыборПредмета" тогда
		ЗаполнитьТемуЗвонка(ВыбранноеЗначение);
	конецесли;
КонецПроцедуры


&НаКлиенте
Процедура Док__ПозвонитьПосле(Команда)
	
	ТелефонияКлиент.ПозвонитьПоНомеру(Объект.АбонентКакСвязаться, Объект.АбонентКонтакт,,);

КонецПроцедуры
